/**
  ********************************  STM32F10x  *********************************
  * @文件名     ： timer.h
  * @作者       ： strongerHuang
  * @库版本     ： V3.5.0
  * @文件版本   ： V1.0.0
  * @日期       ： 2016年10月18日
  * @摘要       ： 定时器头文件
  ******************************************************************************/

/* 定义防止递归包含 ----------------------------------------------------------*/
#ifndef _TIMER_H
#define _TIMER_H


/* 包含的头文件 --------------------------------------------------------------*/
#include "stm32f10x.h"


/* 宏定义 --------------------------------------------------------------------*/
#define TIM3_Period        10 - 1           //定时周期（相对于计数时钟:1周期 = 1计数时钟）
#define TIM3_Prescaler     72 - 1           //1us

#define TIM4_Period        1000-1           //1us*1000=1ms
#define TIM4_Prescaler     72 - 1           //1us

/* 函数申明 ------------------------------------------------------------------*/
void TIMER_Initializes(void);
void delay_10us(uint16_t Times);
void delay_ms(uint16_t Times);


#endif /* _TIMER_H */

/**** Copyright (C)2016 strongerHuang. All Rights Reserved **** END OF FILE ****/
